### IMPORT LIBERARY

In [6]:
import pandas as pd
import numpy as np

### CREATE DATAFRAME

In [7]:
df = pd.DataFrame([[1,2],[3,4],[5,6],[7,8]], index=['R1','R2','R3','R4'], columns=['C1','C2'])

In [8]:
df

    C1  C2
R1   1   2
R2   3   4
R3   5   6
R4   7   8

### CREATE DATAFRAME

In [9]:
vf = pd.DataFrame()
vf['C1'] = [1,2,3,4,5]
vf['C2'] = [6,7,8,9,0]
vf.index = ['R1','R2','R3','R4','R5']
vf

    C1  C2
R1   1   6
R2   2   7
R3   3   8
R4   4   9
R5   5   0

### CLEAN DATAFRAME

In [10]:
Cvf = vf[vf<5]
Cvf

     C1   C2
R1  1.0  NaN
R2  2.0  NaN
R3  3.0  NaN
R4  4.0  NaN
R5  NaN  0.0

### TRANSPORT DATAFRAME

In [18]:
Cvf.T

     R1   R2   R3   R4   R5
C1  1.0  2.0  3.0  4.0  NaN
C2  NaN  NaN  NaN  NaN  0.0

### DISPLAY STATISTICAL VALUES

In [11]:
df.describe()

             C1        C2
count  4.000000  4.000000
mean   4.000000  5.000000
std    2.581989  2.581989
min    1.000000  2.000000
25%    2.500000  3.500000
50%    4.000000  5.000000
75%    5.500000  6.500000
max    7.000000  8.000000

### REMOVE COLUMN C2 IN DATAFRAME

In [12]:
df.drop('C2',axis=1)

    C1
R1   1
R2   3
R3   5
R4   7

### SORT VALUES ACCORDING TO COLUMN C2

In [13]:
vf.sort_values(by='C2')

    C1  C2
R5   5   0
R1   1   6
R2   2   7
R3   3   8
R4   4   9

### SORT DATA ACCORDING TO INDEX IN COLUMN

In [14]:
vf.sort_index(axis=1)

    C1  C2
R1   1   6
R2   2   7
R3   3   8
R4   4   9
R5   5   0

### GET DATA

In [15]:
vf.iloc[2][1]

8

### GET DATA

In [16]:
df.iloc[1]['C2']

4

### CREATE DATAFRAME WITH RANDOM

In [17]:
pd.DataFrame(np.random.randn(10,4))

          0         1         2         3
0 -0.822973  0.716752 -0.534872  0.141957
1  0.953275  0.800879  0.642690  0.615508
2  0.936385  0.798931 -0.891344 -0.647877
3 -0.494600  0.555795  0.461949  1.488449
4 -1.432173 -0.812019 -0.828507  1.366984
5 -1.426437  0.062509 -2.413427 -1.116433
6  0.827718  0.920305  2.192497  2.210182
7 -0.595330  0.858165  1.462871  0.114058
8  1.225110  1.007100  1.229294 -0.161676
9 -0.684998 -1.156937 -0.852691 -1.214754